InformationRegisters/омг_СоответствиеМедЦентровПАКС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>омг_СоответствиеМедЦентровПАКС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Клиника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаименованиеПАКС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/омг_РезультатИсследованияMedreview.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>омг_РезультатИсследованияMedreview</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешнийИдентификатор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУслуги</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИИНПациента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пациент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИИНВрача</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОВрача</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗаключения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлРезультата</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекомендацииВрача</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПримечаниеКЗаключению</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаДеталиИсследования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заявка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.омг_ПоказателиИсследования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.омг_ПоказателиИсследования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>омг_МедПерсонал</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:EnumRef.омг_РолиПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчаствуетВКалендарномПланировании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Специализация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойСпособЗаполненияГрафика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыЗаполненияГрафиковРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьПриема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОМС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимДлительностиЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РежимДлительностиЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформацияДляЖЗ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СНИЛС</Name>
					<Comment>Страховой номер индивидуального лицевого счета пенсионного свидетельства </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_ИдентификационныйКодЛичности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_idoctorId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_idoctorНеВыгружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Специализации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Специализация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СпециализацииФРМР</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Специализация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/омг_ИнтеграцияСMedreview/Ext/Module.bsl
Функция ОтветПоРезультатуОшибка(КодСостояния = 400)
	
	Ответ = Новый HTTPСервисОтвет(КодСостояния);
	
	СтруктураОтвета = Новый Структура("Delivered_status", "ERROR");
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON);
	ЗаписатьJSON(ЗаписьJSON, СтруктураОтвета);
	ТелоОтвета = ЗаписьJSON.Закрыть();
	
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучениеJWT(Запрос) Экспорт
	
	Настройки = омг_ИнтеграцияСMedreviewПовтИсп.ПолучитьНастройки();
	
	ЧтениеJSON = Новый ЧтениеJSON;
	
	Попытка
		
		ЧтениеJSON.УстановитьСтроку(Запрос.ПолучитьТелоКакСтроку());
		СтруктураЗапроса = ПрочитатьJSON(ЧтениеJSON, Ложь);
		ЧтениеJSON.Закрыть();
		
	Исключение
		
		Ответ = Новый HTTPСервисОтвет(400);
		Возврат Ответ;
		
	КонецПопытки;       
	
	Логин = "";
	Пароль = "";
	
	Если Не СтруктураЗапроса.Свойство("systemUsername", Логин)
		Или Не СтруктураЗапроса.Свойство("systemPassword", Пароль) Тогда
		
		Ответ = Новый HTTPСервисОтвет(400);
		Возврат Ответ;
		
	КонецЕсли;
	
	Если Не Логин = Настройки.ЛогинВнешнегоДоступа
		Или Не Пароль = Настройки.ПарольВнешнегоДоступа Тогда
		
		Ответ = Новый HTTPСервисОтвет(401);
		Возврат Ответ;
		
	КонецЕсли;
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	ТокенДоступа = Новый ТокенДоступа;
	ТокенДоступа.Заголовки.Вставить("alg", "HS256");
	
	ТокенДоступа.Эмитент = "ssl";
	ТокенДоступа.Получатели = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("Medreview");
	ТокенДоступа.КлючСопоставленияПользователя = Настройки.ИмяПользователя;
	ТокенДоступа.ВремяСоздания = ТекущаяУниверсальнаяДата() - Дата(1970,1,1,0,0,0);
	ТокенДоступа.ВремяЖизни = ?(Настройки.ВремяЖизниТокена = 0, 1, Настройки.ВремяЖизниТокена) * 60 * 60;
	ТокенДоступа.Идентификатор = Новый УникальныйИдентификатор;
	
	ТокенДоступа.Подписать(АлгоритмПодписиТокенаДоступа.HS256, "EgH23sF8nL3xEGT2kEmAgxWyaKWvcf3p");
	
	Ответ.УстановитьТелоИзСтроки(Строка(ТокенДоступа));
	
	Возврат Ответ;
	
КонецФункции

Функция ОбязательныеПоляСуществуютИЗаполнены(СтруктураДанных)
	
	ОбязательныеПоля = "id,patient_iin,conclusion_date_time,conclusion_doctor_iin,file_results,organization_name";
	
	МассивПолей = СтрРазделить(ОбязательныеПоля, ",");
	
	Для Каждого Поле Из МассивПолей Цикл
		Значение = Неопределено;
		Если Не (СтруктураДанных.Свойство(Поле) И ЗначениеЗаполнено(СтруктураДанных[Поле])) Тогда
			
			Возврат Ложь;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	                                                                                                                                     	
КонецФункции

Процедура ДобавитьПоказатель(СтруктураДанных, Показатели, ПутьПоказателя)
	
	ПоляПоказателя = СтрРазделить(ПутьПоказателя, ".");
	
	Значение = СтруктураДанных;
	
	Показатель = "";
	
	Для Каждого Поле Из ПоляПоказателя Цикл
		Если Значение = Неопределено Тогда
			Прервать;
		КонецЕсли;
		Значение.Свойство(Поле, Значение);
		Показатель = Поле;
	КонецЦикла;
	
	СтрокаПоказателя = Показатели.Добавить();
	СтрокаПоказателя.Показатель = ПутьПоказателя;
	СтрокаПоказателя.Значение = Значение;
	
КонецПроцедуры

Функция СоздатьНовыйПоказатель(ПолеПоказателя, Значение)
	
	НовыйПоказатель = ПланыВидовХарактеристик.омг_ПоказателиИсследования.СоздатьЭлемент();
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(ТипЗнч(Значение));
	НовыйПоказатель.ТипЗначения = Новый ОписаниеТипов(МассивТипов);
	НовыйПоказатель.Наименование = ПолеПоказателя;
	НовыйПоказатель.ПолеПоказателя = ПолеПоказателя;
	НовыйПоказатель.Записать();
	
	Возврат НовыйПоказатель;
	
КонецФункции

Функция ОбработатьЗначениеДанныхПоказателя(СтрокаПоказателей, ВыборкаИзвестныеПоказатели, 
	СвойствоПоляДаннных, ТипыПоказателя, СозданныеЗначенияПоказателей)
	
	ВыборкаЗначенияИзвестныхПоказателей = ВыборкаИзвестныеПоказатели.Выбрать();
	
	ЕстьЗначение = Ложь;
	
	Пока ВыборкаЗначенияИзвестныхПоказателей.НайтиСледующий(Строка(СвойствоПоляДаннных.Значение), "Кодификатор") Цикл
		
		Если ТипыПоказателя.СодержитТип(ТипЗнч(ВыборкаЗначенияИзвестныхПоказателей.Значение)) Тогда
			Значение = ВыборкаЗначенияИзвестныхПоказателей.Значение;
			
			ЕстьЗначение = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЕстьЗначение Тогда
		Значение = СвойствоПоляДаннных.Значение;
		
		Для Каждого ТипПоказателя Из ТипыПоказателя.Типы() Цикл
			Если Не Справочники.ТипВсеСсылки().СодержитТип(ТипПоказателя) Тогда
				Продолжить;
			КонецЕсли;     
			
			Если ТипПоказателя = Тип("СправочникСсылка.омг_ЗначенияПоказателейИсследования") Тогда
				НовоеЗначениеПоказателя = Справочники.омг_ЗначенияПоказателейИсследования.СоздатьЭлемент();
				НовоеЗначениеПоказателя.Владелец = СтрокаПоказателей.Показатель;
				НовоеЗначениеПоказателя.Кодификатор = СвойствоПоляДаннных.Значение;
				НовоеЗначениеПоказателя.Наименование = НовоеЗначениеПоказателя.Кодификатор;
				НовоеЗначениеПоказателя.Записать();
				
				Значение = НовоеЗначениеПоказателя.Ссылка;
				
			Иначе
				Справочник = Метаданные.НайтиПоТипу(ТипПоказателя).Имя;
				СтруктураПоиска = Новый Структура("Справочник, Показатель, Значение", 
					Справочник, СтрокаПоказателей.Показатель, Значение);
					
				НайденныеЗначения = СозданныеЗначенияПоказателей.НайтиСтроки(СтруктураПоиска);
				Если НайденныеЗначения.Количество() = 0 Тогда
					НовоеЗначениеПоказателя = Справочники[Справочник].СоздатьЭлемент();
					НовоеЗначениеПоказателя.Код = СвойствоПоляДаннных.Значение;
					НовоеЗначениеПоказателя.Наименование = НовоеЗначениеПоказателя.Код;
					НовоеЗначениеПоказателя.Записать();
					
					СозданноеЗначение = СозданныеЗначенияПоказателей.Добавить();
					СозданноеЗначение.Показатель = СтрокаПоказателей.Показатель;
					СозданноеЗначение.Значение = СвойствоПоляДаннных.Значение;
					СозданноеЗначение.Справочник = Справочник;
					
					Значение = НовоеЗначениеПоказателя.Ссылка;

				Иначе
					Значение = НайденныеЗначения[0].Значение;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Процедура ОбработатьДанныеДляПоказателя(ВыборкаИзвестныеПоказатели, Показатели, СвойствоПоляДаннных, Родитель = "", СозданныеЗначенияПоказателей)
	
	СтрокаПоказателей = Показатели.Добавить();
	
	ПолеПоказателя = ?(Родитель = "", "", Родитель + ".") + СвойствоПоляДаннных.Ключ;
	
	ВыборкаИзвестныеПоказатели.Сбросить();
	ТипыПоказателя = Неопределено;
	Если ВыборкаИзвестныеПоказатели.НайтиСледующий(ПолеПоказателя, "ПолеПоказателя") Тогда
		
		ТипыПоказателя = ВыборкаИзвестныеПоказатели.ТипЗначения;
		
		СтрокаПоказателей.Показатель = ВыборкаИзвестныеПоказатели.Показатель;
		
		СтрокаПоказателей.Значение = ОбработатьЗначениеДанныхПоказателя(СтрокаПоказателей, 
			ВыборкаИзвестныеПоказатели, СвойствоПоляДаннных, ТипыПоказателя, СозданныеЗначенияПоказателей);
		
	Иначе 
		
		НовыЙПоказатель = СоздатьНовыйПоказатель(ПолеПоказателя, СвойствоПоляДаннных.Значение);
		СтрокаПоказателей.Показатель = НовыЙПоказатель.Ссылка;
		
		ТипыПоказателя = НовыЙПоказатель.ТипЗначения;
		Если Родитель = "" Тогда
			СтрокаПоказателей.Значение = СвойствоПоляДаннных.Значение;
		Иначе
			СтрокаПоказателей.Значение = ОбработатьЗначениеДанныхПоказателя(СтрокаПоказателей, 
				ВыборкаИзвестныеПоказатели, СвойствоПоляДаннных, ТипыПоказателя, СозданныеЗначенияПоказателей)	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьВсеПоляПоказателейИЗначения(СтруктураДанных, ПоляНеПоказатели)
	
	МассивПолей = Новый Массив;
	МассивЗначений = Новый Массив;
	
	Для Каждого ПолеДанных Из СтруктураДанных Цикл
		
		Если СтрНайти(ПоляНеПоказатели, ПолеДанных.Ключ) > 0 Тогда
			Продолжить;
		КонецЕсли;		
		
		Если ТипЗнч(ПолеДанных.Значение) = Тип("Структура") Тогда
			
			Для Каждого СвойствоПоляДаннных Из ПолеДанных.Значение Цикл
				
				ПолеПоказателя = ?(ПолеДанных.Ключ = "", "", ПолеДанных.Ключ + ".") + СвойствоПоляДаннных.Ключ;
				
				МассивПолей.Добавить(ПолеПоказателя);
				Если МассивЗначений.Найти(Строка(СвойствоПоляДаннных.Значение)) = Неопределено Тогда
					МассивЗначений.Добавить(Строка(СвойствоПоляДаннных.Значение));
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			МассивПолей.Добавить(ПолеДанных.Ключ);
			Если МассивЗначений.Найти(Строка(ПолеДанных.Значение)) = Неопределено Тогда
				МассивЗначений.Добавить(Строка(ПолеДанных.Значение));
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;    
	
	Возврат Новый Структура("МассивПолей, МассивЗначений",МассивПолей, МассивЗначений);

КонецФункции

Функция ЗаписатьРезультатыИсследования(Запрос) Экспорт 
	
	
	ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТелоЗапроса);
	
	Попытка
		
		СтруктураДанных = ПрочитатьJSON(ЧтениеJSON, Ложь);
		
	Исключение
		
		Возврат ОтветПоРезультатуОшибка();
		
	КонецПопытки;
	
	ЧтениеJSON.Закрыть();
	
	Если Не ОбязательныеПоляСуществуютИЗаполнены(СтруктураДанных) Тогда
		Возврат ОтветПоРезультатуОшибка();
	КонецЕсли;
	
	Запрос = Новый Запрос;

	ПервыйЗапрос = Истина;
	Для Каждого ТипПлана Из Метаданные.ПланыВидовХарактеристик.омг_ПоказателиИсследования.Тип.Типы() Цикл

		Если Не Справочники.ТипВсеСсылки().СодержитТип(ТипПлана) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипПлана = Тип("СправочникСсылка.омг_ЗначенияПоказателейИсследования") Тогда
			Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ 
			|	Владелец, Кодификатор, 
			|	Ссылка
			|ИЗ 
			|	Справочник." + Метаданные.НайтиПоТипу(ТипПлана).Имя + "
			|ГДЕ
			|	Кодификатор В (&ЗначенияПоказателей)
			|
			|ОБЪЕДИНИТЬ ВСЕ ";
		Иначе
			Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ 
			|	Неопределено КАК Владалец, Код КАК Кодификатор, 
			|	Ссылка
			|ИЗ 
			|	Справочник." + Метаданные.НайтиПоТипу(ТипПлана).Имя + "
			|ГДЕ
			|	Код В (&ЗначенияПоказателей)
			|
			|ОБЪЕДИНИТЬ ВСЕ ";
		КонецЕсли;
		
		Если ПервыйЗапрос Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Ссылка", "
			|	Ссылка
			|ПОМЕСТИТЬ ВТ_ЗначенияПоказателей");
		КонецЕсли;
		
		ПервыйЗапрос = Ложь
		
	КонецЦикла;
	
	Запрос.Текст = Лев(Запрос.Текст, СтрДлина(Запрос.Текст) - 15) + "; ";
	
	Запрос.Текст = Запрос.Текст +"ВЫБРАТЬ
	                             |	омг_РезультатИсследованияMedreview.Ссылка КАК Ссылка
	                             |ИЗ
	                             |	Документ.омг_РезультатИсследованияMedreview КАК омг_РезультатИсследованияMedreview
	                             |ГДЕ
	                             |	омг_РезультатИсследованияMedreview.ВнешнийИдентификатор = &ВнешнийИдентификатор
	                             |;
	                             |
	                             |////////////////////////////////////////////////////////////////////////////////
	                             |ВЫБРАТЬ
	                             |	ВложенныйЗапрос.Поле1 КАК Поле1,
	                             |	ЕСТЬNULL(Клиенты.Ссылка, НЕОПРЕДЕЛЕНО) КАК Пациент,
	                             |	ЕСТЬNULL(омг_СоответствиеМедЦентровПАКС.Клиника, НЕОПРЕДЕЛЕНО) КАК Филиал,
	                             |	ЕСТЬNULL(Сотрудники.Ссылка, НЕОПРЕДЕЛЕНО) КАК Врач,
	                             |	ЕСТЬNULL(Номенклатура.Ссылка, НЕОПРЕДЕЛЕНО) КАК Услуга
	                             |ИЗ
	                             |	(ВЫБРАТЬ
	                             |		1 КАК Поле1) КАК ВложенныйЗапрос
	                             |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Клиенты КАК Клиенты
	                             |		ПО (Клиенты.ИНН = &ИИНПациента)
	                             |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	                             |		ПО (Сотрудники.омг_ИдентификационныйКодЛичности = &ИКЛ)
	                             |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	                             |		ПО (Номенклатура.Артикул = &КодУслуги),
	                             |	РегистрСведений.омг_СоответствиеМедЦентровПАКС КАК омг_СоответствиеМедЦентровПАКС
	                             |;
	                             |
	                             |////////////////////////////////////////////////////////////////////////////////
	                             |ВЫБРАТЬ
	                             |	омг_ПоказателиИсследования.Ссылка КАК Ссылка,
	                             |	омг_ПоказателиИсследования.ТипЗначения КАК ТипЗначения,
	                             |	омг_ПоказателиИсследования.ПолеПоказателя КАК ПолеПоказателя
	                             |ПОМЕСТИТЬ ВТ_Показатели
	                             |ИЗ
	                             |	ПланВидовХарактеристик.омг_ПоказателиИсследования КАК омг_ПоказателиИсследования
	                             |ГДЕ
	                             |	омг_ПоказателиИсследования.ПолеПоказателя В(&ПоляПоказателей)
	                             |;
	                             |
	                             |////////////////////////////////////////////////////////////////////////////////
	                             |ВЫБРАТЬ
	                             |	омг_ПоказателиИсследования.Ссылка КАК Показатель,
	                             |	омг_ЗначенияПоказателейИсследования.Ссылка КАК Значение,
	                             |	омг_ЗначенияПоказателейИсследования.Кодификатор КАК Кодификатор,
	                             |	омг_ПоказателиИсследования.Ссылка.ПолеПоказателя КАК ПолеПоказателя,
	                             |	омг_ПоказателиИсследования.Ссылка.ТипЗначения КАК ТипЗначения
	                             |ИЗ
	                             |	ВТ_Показатели КАК омг_ПоказателиИсследования
	                             |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗначенияПоказателей КАК омг_ЗначенияПоказателейИсследования
	                             |		ПО (ВЫБОР
	                             |				КОГДА ТИПЗНАЧЕНИЯ(омг_ЗначенияПоказателейИсследования.Ссылка) = ТИП(Справочник.омг_ЗначенияПоказателейИсследования)
	                             |					ТОГДА омг_ПоказателиИсследования.Ссылка = омг_ЗначенияПоказателейИсследования.Владелец
	                             |				ИНАЧЕ ИСТИНА
	                             |			КОНЕЦ)
	                             |ИТОГИ ПО
	                             |	Показатель
	                             |;
	                             |
	                             |////////////////////////////////////////////////////////////////////////////////
	                             |ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	                             |	ЗаявкаРаботы.Ссылка КАК СвободнаяЗаявка
	                             |ИЗ
	                             |	РегистрСведений.омг_СоответствиеМедЦентровПАКС КАК омг_СоответствиеМедЦентровПАКС
	                             |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.Работы КАК ЗаявкаРаботы
	                             |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Прием КАК Прием
	                             |			ПО ЗаявкаРаботы.Ссылка = Прием.ДокументОснование
	                             |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.омг_РезультатИсследованияMedreview КАК омг_РезультатИсследованияMedreview
	                             |			ПО ЗаявкаРаботы.Ссылка = омг_РезультатИсследованияMedreview.Заявка
	                             |		ПО (ЗаявкаРаботы.Ссылка.Филиал = омг_СоответствиеМедЦентровПАКС.Клиника)
	                             |ГДЕ
	                             |	ЗаявкаРаботы.Ссылка.Клиент.ИНН = &ИИНПациента
	                             |	И омг_СоответствиеМедЦентровПАКС.НаименованиеПАКС = &НаименованиеФилиала
	                             |	И ЗаявкаРаботы.Ссылка.Сотрудник.омг_ИдентификационныйКодЛичности = &ИКЛ
	                             |	И ЗаявкаРаботы.Номенклатура.Артикул = &КодУслуги
	                             |	И омг_РезультатИсследованияMedreview.Ссылка ЕСТЬ NULL
	                             |	И Прием.Ссылка ЕСТЬ NULL
	                             |
	                             |УПОРЯДОЧИТЬ ПО
	                             |	ЗаявкаРаботы.Ссылка.Дата";
	Запрос.УстановитьПараметр("ВнешнийИдентификатор", СтруктураДанных.id);
	Запрос.УстановитьПараметр("ИИНПациента", СтруктураДанных.patient_iin);
	Запрос.УстановитьПараметр("НаименованиеФилиала", СтруктураДанных.organization_name);
	Запрос.УстановитьПараметр("ИКЛ", СтруктураДанных.conclusion_doctor_iin);
	
	ПоляНеПоказатели = "id, patient_iin, conclusion_date_time, 
						|conclusion_doctor_iin, conclusion_doctor_fullname, conclusion_text, 
						|file_results, service_code, desc, recs, note, details_url, chek_list,
						|organization_name";
	
	ВсеПоляИЗначения = ПолучитьВсеПоляПоказателейИЗначения(СтруктураДанных, ПоляНеПоказатели);
	
	ПоляПоказателей = ВсеПоляИЗначения.МассивПолей;
	ЗначенияПоказателей = ВсеПоляИЗначения.МассивЗначений;
	
	Запрос.УстановитьПараметр("ПоляПоказателей", ПоляПоказателей);
	Запрос.УстановитьПараметр("ЗначенияПоказателей", ЗначенияПоказателей);
	
	КодУслуги = Неопределено;
	СтруктураДанных.Свойство("service_code", КодУслуги);
	//Запрос.УстановитьПараметр("КодУслуги", КодУслуги);
	Запрос.УстановитьПараметр("КодУслуги", СтруктураДанных.service_code);
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	РезультатЗапросаДокументы = ПакетЗапросов[1];
	РезультатЗапросаСправочники = ПакетЗапросов[2];
	
	
	РезультатЗапросаИзвестныеПоказатели = ПакетЗапросов[4]; 
	РезультатЗапросаСвободныеЗАявки = ПакетЗапросов[5];
    
	
	ВыборкаСправочникиПоДанным = РезультатЗапросаСправочники.Выбрать();
	ВыборкаСправочникиПоДанным.Следующий();
	
	ВыборкаИзвестныеПоказатели = РезультатЗапросаИзвестныеПоказатели.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если Не РезультатЗапросаДокументы.Пустой() Тогда
		
		Выборка = РезультатЗапросаДокументы.Выбрать();
		Выборка.Следующий();
		
		ДокументРезультатИсследования = Выборка.Ссылка.ПолучитьОбъект();
	Иначе
		ДокументРезультатИсследования = Документы.омг_РезультатИсследованияMedreview.СоздатьДокумент();
		ДокументРезультатИсследования.ВнешнийИдентификатор = СтруктураДанных.id;
	КонецЕсли;
	
	Год = Сред(СтруктураДанных.conclusion_date_time, 1, 4);
	Месяц = Сред(СтруктураДанных.conclusion_date_time, 6, 2);
	День = Сред(СтруктураДанных.conclusion_date_time, 9, 2);
	Час = Сред(СтруктураДанных.conclusion_date_time, 12, 2);
	Минута = Сред(СтруктураДанных.conclusion_date_time, 15, 2);
	Секунда = Сред(СтруктураДанных.conclusion_date_time, 18, 2);
	ДатаДокумента = Дата(Год, Месяц, День, Час, Минута, Секунда);
	
	ДокументРезультатИсследования.Дата = ДатаДокумента;
	
	СтруктураДанных.Свойство("patient_iin", ДокументРезультатИсследования.ИИНПациента);
	СтруктураДанных.Свойство("conclusion_doctor_iin", ДокументРезультатИсследования.ИИНВрача);
	СтруктураДанных.Свойство("conclusion_doctor_fullname", ДокументРезультатИсследования.ФИОВрача);
	СтруктураДанных.Свойство("conclusion_text", ДокументРезультатИсследования.ТекстЗаключения);
	
	ДанныеДокументаBasee64 = "";
	
	СтруктураДанных.Свойство("file_results", ДанныеДокументаBasee64);
	
	Если ДанныеДокументаBasee64.Количество() > 0 Тогда
		ДанныеДокументаBasee64 = ДанныеДокументаBasee64[0].file_content;
	КонецЕсли;
	
	Попытка
		
		ДокументРезультатИсследования.ФайлРезультата = Новый ХранилищеЗначения(Base64Значение(ДанныеДокументаBasee64));
		
	Исключение
		
		Возврат ОтветПоРезультатуОшибка();
		
	КонецПопытки;
	
	СтруктураДанных.Свойство("service_code", ДокументРезультатИсследования.КодУслуги);
	
	ДокументРезультатИсследования.Услуга = ВыборкаСправочникиПоДанным.Услуга;
	
	//// не создаем номенклатуру
	//Если ДокументРезультатИсследования.Услуга.Пустая() Тогда 
	//	НоваяУслуга = Справочники.НоменклатураМедицинскихУслуг.СоздатьЭлемент();
	//	НоваяУслуга.Код = ДокументРезультатИсследования.КодУслуги;
	//	МакетКлассификаторУслуг = Справочники.НоменклатураМедицинскихУслуг.ПолучитьМакет("омг_КлассификаторМедицинскихУслуг");
	//	ОбластьКодУслуги = МакетКлассификаторУслуг.НайтиТекст(НоваяУслуга.Код,,,,,, Истина);
	//	ОбластьНаименование = МакетКлассификаторУслуг.ПолучитьОбласть(ОбластьКодУслуги.Верх, ОбластьКодУслуги.Лево + 1);
	//		
	//	НоваяУслуга.Наименование = ОбластьНаименование.ТекущаяОбласть.Текст;
	//	НоваяУслуга.Записать();
	//	
	//	ДокументРезультатИсследования.Услуга = НоваяУслуга.Ссылка;
	//КонецЕсли;
	
	ДокументРезультатИсследования.Пациент = ВыборкаСправочникиПоДанным.Пациент;
	
	Показатели = ДокументРезультатИсследования.Показатели;
	
	Показатели.Очистить();
	
	СозданныеЗначенияПоказателей = Новый ТаблицаЗначений;
	СозданныеЗначенияПоказателей.Колонки.Добавить("Справочник");
	СозданныеЗначенияПоказателей.Колонки.Добавить("Показатель");
	СозданныеЗначенияПоказателей.Колонки.Добавить("Значение");
	
	Для Каждого ПолеДанных Из СтруктураДанных Цикл
		
		Если СтрНайти(ПоляНеПоказатели, ПолеДанных.Ключ) > 0 Тогда
			Продолжить;
		КонецЕсли;		
		
		Если ТипЗнч(ПолеДанных.Значение) = Тип("Структура") Тогда
			
			ВыборкаИзвестныеПоказатели.Сбросить();
			Для Каждого СвойствоПоляДаннных Из ПолеДанных.Значение Цикл
				
				ОбработатьДанныеДляПоказателя(ВыборкаИзвестныеПоказатели, Показатели, СвойствоПоляДаннных, ПолеДанных.Ключ, СозданныеЗначенияПоказателей);
				
			КонецЦикла;
			
		Иначе
			
			ОбработатьДанныеДляПоказателя(ВыборкаИзвестныеПоказатели, Показатели, ПолеДанных,,СозданныеЗначенияПоказателей);

		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураДанных.Свойство("desc", ДокументРезультатИсследования.Описание);
	
	МассивРекомендаций = Неопределено;
	СтруктураДанных.Свойство("recs", МассивРекомендаций);
	Если Не МассивРекомендаций = Неопределено Тогда
		СтрокаРекомендации = "";
		
		Если ТипЗнч(МассивРекомендаций) = Тип("Массив") Тогда
			Для Каждого Рекомендация Из МассивРекомендаций Цикл
				СтрокаРекомендации = СтрокаРекомендации + Рекомендация + "; ";
			КонецЦикла;
		Иначе
			СтрокаРекомендации  = МассивРекомендаций;
		КонецЕсли;
		
		ДокументРезультатИсследования.РекомендацииВрача = СтрокаРекомендации
		
	КонецЕсли;
	СтруктураДанных.Свойство("note", ДокументРезультатИсследования.ПримечаниеКЗаключению);
	СтруктураДанных.Свойство("details_url", ДокументРезультатИсследования.СсылкаНаДеталиИсследования);
	
	ДокументРезультатИсследования.Филиал = ВыборкаСправочникиПоДанным.Филиал;
	ДокументРезультатИсследования.Врач = ВыборкаСправочникиПоДанным.Врач;
	
	Если не значениеЗаполнено(ДокументРезультатИсследования.Заявка) Тогда
		ВыборкаРезультатЗапросаСвободныеЗАявки = РезультатЗапросаСвободныеЗАявки.Выбрать();
		Если ВыборкаРезультатЗапросаСвободныеЗАявки.Количество() > 0 Тогда  
			ВыборкаРезультатЗапросаСвободныеЗАявки.Следующий();
			ДокументРезультатИсследования.Заявка = ВыборкаРезультатЗапросаСвободныеЗАявки.СвободнаяЗаявка;	
			ДокументРезультатИсследования.омг_МедПерсонал.Очистить();
			ДокументРезультатИсследования.омг_МедПерсонал.Загрузить(ДокументРезультатИсследования.Заявка.омг_МедПерсонал.Выгрузить());
		КонецЕсли;	
	КонецЕсли;

	ДокументРезультатИсследования.Записать();
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	СтруктураОтвета = Новый Структура("Delivered_status", "SUCCESS");
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON);
	ЗаписатьJSON(ЗаписьJSON, СтруктураОтвета);
	ТелоОтвета = ЗаписьJSON.Закрыть();
	
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	
	Возврат Ответ;
	
КонецФункции
